# MongoDB Export
mongoexport --uri="mongodb+srv://piyaphon:qwerty1234@cluster0.ssxd5he.mongodb.net/sample_supplies" --collection="sales" --jsonArray --out=sales.json

In [3]:
import pandas as pd

# Load data

In [4]:
df = pd.read_json("sales.json")

# 1. Show top 10 products (name) sales (quantity x price).

In [5]:
# Explode items to several rows
df = df.explode('items')

# Normalize and create sales column
df['product'] = df['items'].apply(lambda x: x['name'])
df['tags'] = df['items'].apply(lambda x: x['tags'])
df['quantity'] = df['items'].apply(lambda x: x['quantity'])
df['price'] = df['items'].apply(lambda x: float(x['price']['$numberDecimal']))
df['sales'] = df['items'].apply(lambda x: x['quantity'] * float(x['price']['$numberDecimal']))
df = df.drop('items', axis=1)
df

,_id,saleDate,storeLocation,customer,couponUsed,purchaseMethod,product,tags,quantity,price,sales
0,{'$oid': '5bd761dcae323e45a93ccfe8'},{'$date': '2015-03-23T21:06:49.506Z'},Denver,"{'gender': 'M', 'age': 42, 'email': 'cauho@wit...",True,Online,printer paper,"[office, stationary]",2,40.01,80.02
0,{'$oid': '5bd761dcae323e45a93ccfe8'},{'$date': '2015-03-23T21:06:49.506Z'},Denver,"{'gender': 'M', 'age': 42, 'email': 'cauho@wit...",True,Online,notepad,"[office, writing, school]",2,35.29,70.58
0,{'$oid': '5bd761dcae323e45a93ccfe8'},{'$date': '2015-03-23T21:06:49.506Z'},Denver,"{'gender': 'M', 'age': 42, 'email': 'cauho@wit...",True,Online,pens,"[writing, office, school, stationary]",5,56.12,280.60
0,{'$oid': '5bd761dcae323e45a93ccfe8'},{'$date': '2015-03-23T21:06:49.506Z'},Denver,"{'gender': 'M', 'age': 42, 'email': 'cauho@wit...",True,Online,backpack,"[school, travel, kids]",2,77.71,155.42
0,{'$oid': '5bd761dcae323e45a93ccfe8'},{'$date': '2015-03-23T21:06:49.506Z'},Denver,"{'gender': 'M', 'age': 42, 'email': 'cauho@wit...",True,Online,notepad,"[office, writing, school]",2,18.47,36.94
...,...,...,...,...,...,...,...,...,...,...,...
4999,{'$oid': '5bd761deae323e45a93ce36f'},{'$date': '2014-08-18T06:25:49.739Z'},New York,"{'gender': 'M', 'age': 33, 'email': 'lihzodud@...",False,Online,envelopes,"[stationary, office, general]",5,24.12,120.60
4999,{'$oid': '5bd761deae323e45a93ce36f'},{'$date': '2014-08-18T06:25:49.739Z'},New York,"{'gender': 'M', 'age': 33, 'email': 'lihzodud@...",False,Online,pens,"[writing, office, school, stationary]",4,27.10,108.40
4999,{'$oid': '5bd761deae323e45a93ce36f'},{'$date': '2014-08-18T06:25:49.739Z'},New York,"{'gender': 'M', 'age': 33, 'email': 'lihzodud@...",False,Online,binder,"[school, general, organization]",3,29.09,87.27
4999,{'$oid': '5bd761deae323e45a93ce36f'},{'$date': '2014-08-18T06:25:49.739Z'},New York,"{'gender': 'M', 'age': 33, 'email': 'lihzodud@...",False,Online,laptop,"[electronics, school, office]",2,598.79,1197.58
4999,{'$oid': '5bd761deae323e45a93ce36f'},{'$date': '2014-08-18T06:25:49.739Z'},New York,"{'gender': 'M', 'age': 33, 'email': 'lihzodud@...",False,Online,backpack,"[school, travel, kids]",3,70.90,212.70

In [8]:
top_sales_data = df.groupby('product').sales.agg('sum').reset_index()
top_sales_data.sort_values(by=['sales'], ascending=[False])

         product       sales
3         laptop  6775977.07
0       backpack   817374.10
5           pens   581843.27
1         binder   511644.57
4        notepad   463615.48
2      envelopes   376658.49
6  printer paper   367459.29

# 2. Show top 3 products (name) sales by store (location)

In [319]:
# Group by 'storeLocation' and 'product' and sum the sales
grouped_data = df.groupby(['storeLocation', 'product'])['sales'].sum().reset_index()
sorted_groups = grouped_data.sort_values(by=['storeLocation', 'sales'], ascending=[True, False])
sorted_groups

   storeLocation        product       sales
3         Austin         laptop  1018494.05
0         Austin       backpack   115217.59
5         Austin           pens    74622.52
4         Austin        notepad    70361.69
1         Austin         binder    67039.88
2         Austin      envelopes    52778.02
6         Austin  printer paper    47089.36
10        Denver         laptop  1961659.25
7         Denver       backpack   245679.34
12        Denver           pens   185008.39
8         Denver         binder   160408.23
11        Denver        notepad   139516.98
9         Denver      envelopes   116403.99
13        Denver  printer paper   112333.74
17        London         laptop  1073098.72
14        London       backpack   144529.14
19        London           pens    92602.30
15        London         binder    77435.14
18        London        notepad    72279.50
20        London  printer paper    61844.25
16        London      envelopes    61277.74
24      New York         laptop   694613.32
21      New York       backpack    82563.14
26      New York           pens    64029.90
22      New York         binder    51664.11
25      New York        notepad    46232.30
23      New York      envelopes    39020.42
27      New York  printer paper    37936.40
31     San Diego         laptop   462973.58
28     San Diego       backpack    50997.42
33     San Diego           pens    42134.55
29     San Diego         binder    37107.24
32     San Diego        notepad    31875.97
34     San Diego  printer paper    24899.26
30     San Diego      envelopes    22897.15
38       Seattle         laptop  1565138.15
35       Seattle       backpack   178387.47
40       Seattle           pens   123445.61
36       Seattle         binder   117989.97
39       Seattle        notepad   103349.04
37       Seattle      envelopes    84281.17
41       Seattle  printer paper    83356.28

In [321]:
top_products = sorted_groups.groupby('storeLocation').head(3)
top_products

   storeLocation   product       sales
3         Austin    laptop  1018494.05
0         Austin  backpack   115217.59
5         Austin      pens    74622.52
10        Denver    laptop  1961659.25
7         Denver  backpack   245679.34
12        Denver      pens   185008.39
17        London    laptop  1073098.72
14        London  backpack   144529.14
19        London      pens    92602.30
24      New York    laptop   694613.32
21      New York  backpack    82563.14
26      New York      pens    64029.90
31     San Diego    laptop   462973.58
28     San Diego  backpack    50997.42
33     San Diego      pens    42134.55
38       Seattle    laptop  1565138.15
35       Seattle  backpack   178387.47
40       Seattle      pens   123445.61

# 3. Show rankings of each store (location).

In [322]:
location_groups = df.groupby(['storeLocation'])['sales'].sum().reset_index()
sorted_location_groups = location_groups.sort_values(by=['sales'], ascending=[False])

In [323]:
sorted_location_groups

  storeLocation       sales
1        Denver  2921009.92
5       Seattle  2255947.69
2        London  1583066.79
0        Austin  1445603.11
3      New York  1016059.59
4     San Diego   672885.17

# 4. Show purchased method by gender table

In [324]:
from pandas import json_normalize

df = pd.read_json("sales.json")
df = pd.concat([df, json_normalize(df['customer'])], axis=1)
df.drop(columns=['customer'], inplace=True) 
purchase_method_by_gender = pd.crosstab(df['gender'], df['purchaseMethod'])

In [325]:
purchase_method_by_gender

purchaseMethod  In store  Online  Phone
gender
F                   1430     813    284
M                   1389     772    312

# 5. Show monthly total sales

In [326]:
df = pd.read_json("sales.json")
df = df.explode('items')
df['product'] = df['items'].apply(lambda x: x['name'])
df['tags'] = df['items'].apply(lambda x: x['tags'])
df['quantity'] = df['items'].apply(lambda x: x['quantity'])
df['price'] = df['items'].apply(lambda x: float(x['price']['$numberDecimal']))
df['sales'] = df['items'].apply(lambda x: x['quantity'] * float(x['price']['$numberDecimal']))
df = df.drop('items', axis=1)

In [327]:
# String date to DateTime 
df['saleDate'] = pd.to_datetime(df['saleDate'].str['$date'], format="mixed")
monthly_sales = df.groupby(df['saleDate'].dt.to_period("M"))['sales'].sum().reset_index()
monthly_sales

/var/folders/2v/78tfdk_10ddgpdy_sx9l5hhh0000gn/T/ipykernel_52346/3594762568.py:2: UserWarning: Converting to PeriodArray/Index representation will drop timezone information.
  monthly_sales = df.groupby(df['saleDate'].dt.to_period("M"))['sales'].sum().reset_index()

   saleDate      sales
0   2013-01  196043.76
1   2013-02  147622.59
2   2013-03  140700.06
3   2013-04  162336.67
4   2013-05  179143.37
5   2013-06  142132.02
6   2013-07  176298.23
7   2013-08  130977.22
8   2013-09  137871.99
9   2013-10  173126.73
10  2013-11  148358.38
11  2013-12  174306.96
12  2014-01  125824.02
13  2014-02  141174.41
14  2014-03  193413.50
15  2014-04  132593.08
16  2014-05  166896.80
17  2014-06  143304.56
18  2014-07  184804.60
19  2014-08  167979.81
20  2014-09  159802.92
21  2014-10  149284.84
22  2014-11  180564.85
23  2014-12  139466.83
24  2015-01  222577.01
25  2015-02  189776.15
26  2015-03  178086.94
27  2015-04  132298.50
28  2015-05  167482.69
29  2015-06  149484.34
30  2015-07  149510.47
31  2015-08  154868.63
32  2015-09  135615.80
33  2015-10  175215.34
34  2015-11  158390.42
35  2015-12  166565.02
36  2016-01  166558.93
37  2016-02  120783.52
38  2016-03  193185.17
39  2016-04  137340.27
40  2016-05  162966.06
41  2016-06  132942.54
42  2016-07  180331.10
43  2016-08  164555.33
44  2016-09  138299.53
45  2016-10  151698.93
46  2016-11  170758.41
47  2016-12  215400.07
48  2017-01  207037.75
49  2017-02  134527.54
50  2017-03  162351.15
51  2017-04  191990.94
52  2017-05  202403.85
53  2017-06  201552.55
54  2017-07  156106.90
55  2017-08  173196.13
56  2017-09  186976.26
57  2017-10  191681.25
58  2017-11  202330.86
59  2017-12  175697.72